load-tests/scenarios/A-mass-connection-100.yml
# Cenário A3: 100 participantes
config:
  target: "http://localhost:3000"
  phases:
    - name: "100 participants"
      duration: 45
      arrivalRate: 6
  engines:
    socketio-v3: {}
  processor: "../functions.js"
  variables:
    roomCode: "LOAD01"

scenarios:
  - name: "Join"
    engine: socketio-v3
    flow:
      - function: "setRoomCodeFromEnv"
      - function: "generateUniqueName"
      - emit:
          - "room:join"
          - code: "{{ roomCode }}"
          - name: "{{ participantName }}"
        response:
          on: "room:joined"
      - think: 1