load-tests/scenarios/A-mass-connection.yml
# Cenário A: Conexão massiva - N participantes entram na mesma sala simultaneamente
# Métricas: tempo de join, taxa de sucesso
# Testar: 10, 25, 50, 100, 200, 500 participantes (via --overrides ou cenários específicos)
#
# Uso: node load-tests/run-with-seed.js A-mass-connection-10
# Ou: ROOM_CODE=xxx artillery run load-tests/scenarios/A-mass-connection.yml

config:
  target: "http://localhost:3000"
  phases:
    - name: "mass join"
      duration: 30
      arrivalRate: 5
  engines:
    socketio-v3: {}
  processor: "../functions.js"
  variables:
    roomCode: "LOAD01"

scenarios:
  - name: "Participante entra"
    engine: socketio-v3
    flow:
      - function: "setRoomCodeFromEnv"
      - function: "generateUniqueName"
      - emit:
          - "room:join"
          - code: "{{ roomCode }}"
          - name: "{{ participantName }}"
        response:
          on: "room:joined"
          capture:
            - json: "$.participantId"
              as: "participantId"
            - json: "$.roomId"
              as: "roomId"
      - think: 1