load-tests/scenarios/B-burst-response.yml
# Cenário B: Resposta simultânea (burst)
# Todos os participantes respondem em janela de 1-2 segundos
# Requer sala com jogo iniciado: use seed-and-start.js em outro terminal
#
# Uso: node load-tests/run-with-seed.js B-burst-response
# Ou: ROOM_CODE=xxx artillery run load-tests/scenarios/B-burst-response.yml
#
# Métricas: latência submitAnswer, taxa de respostas aceitas

config:
  target: "http://localhost:3000"
  phases:
    - name: "burst"
      duration: 10
      arrivalRate: 20
  engines:
    socketio-v3: {}
  processor: "../functions.js"
  variables:
    roomCode: "LOAD01"

scenarios:
  - name: "Join e responde imediato"
    engine: socketio-v3
    flow:
      - function: "setRoomCodeFromEnv"
      - function: "generateUniqueName"
      - emit:
          - "room:join"
          - code: "{{ roomCode }}"
          - name: "{{ participantName }}"
        response:
          on: "room:joined"
          capture:
            - json: "$.participantId"
              as: "participantId"
            - json: "$.roomId"
              as: "roomId"
      - think: 0.5
      - function: "pickRandomOption"
      - emit:
          - "answer:submit"
          - optionIndex: "{{ optionIndex }}"
        response:
          on: "answer:result"