load-tests/scenarios/join-and-play-large.yml
# Cenário: Participantes entram - 200 usuários (~90s)
config:
  target: "http://localhost:3000"
  phases:
    - name: "large"
      duration: 90
      arrivalRate: 5
  engines:
    socketio-v3: {}
  processor: "../functions.js"
  variables:
    roomCode: "LOAD01"

scenarios:
  - name: "Participante entra"
    engine: socketio-v3
    flow:
      - function: "setRoomCodeFromEnv"
      - function: "generateUniqueName"
      - emit:
          - "room:join"
          - code: "{{ roomCode }}"
          - name: "{{ participantName }}"
        response:
          on: "room:joined"
          capture:
            - json: "$.participantId"
              as: "participantId"
            - json: "$.roomId"
              as: "roomId"
      - think: 2