load-tests/scenarios/playwright-join-chrome.yml
# Cenário Playwright usando Chrome do sistema (alternativa)
# Use se preferir o Chrome instalado no Mac. Pode causar crash (SIGABRT) em alguns ambientes.
# Uso: node load-tests/run-with-seed.js playwright-join-chrome

config:
  target: "http://localhost:3000"
  processor: "../playwright-functions.js"
  phases:
    - name: "join via browser"
      duration: 15
      arrivalRate: 1
  engines:
    playwright:
      launchOptions:
        channel: "chrome"
        args:
          - "--disable-gpu-sandbox"
          - "--disable-software-rasterizer"
  # roomCode vem do ROOM_CODE (run-with-seed.js) - não usar variável fixa

scenarios:
  - name: "Participante entra via navegador"
    engine: playwright
    testFunction: "joinRoomFlow"