load-tests/scenarios/playwright-join-headed.yml
# Cenário Playwright com navegador visível (não headless)
# Use para ver os testes rodando na tela. Bom para debug.
# Usa Chrome do sistema (não requer yarn test:load:playwright:install)
#
# Uso: node load-tests/run-with-seed.js playwright-join-headed

config:
  target: "http://localhost:3000"
  processor: "../playwright-functions.js"
  phases:
    - name: "join via browser"
      duration: 15
      arrivalRate: 1
  engines:
    playwright:
      launchOptions:
        channel: "chrome"
        headless: false
  # roomCode vem do ROOM_CODE (run-with-seed.js) - não usar variável fixa

scenarios:
  - name: "Participante entra via navegador"
    engine: playwright
    testFunction: "joinRoomFlow"